tutorials/multiphase/multiphaseEulerFoam/laminar/trickleBed/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0.5
    volScalarFieldValue alpha.water 0.0
    volScalarFieldValue alpha.solid 0.5
);

regions
(
    boxToCell
    {
        box (0 0.5001 -0.1) (0.15 1.0 0.1);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.35
            volScalarFieldValue alpha.water 0.15
            volScalarFieldValue alpha.solid 0.5
        );
    }
);


// ************************************************************************* //
